---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled
source: html/d7a6bd22-f9ca-5e82-6a3f-00e111aeb20b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled Property

"Segment Bends"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get; }
```